Процедура ЗаписатьВОчередь(емайл,Тема,Текст) Экспорт
	
	Зап = РегистрыСведений.ОчередьСообщенийОтправка.СоздатьМенеджерЗаписи();
	Зап.идСообщения = новый УникальныйИдентификатор;
	Зап.Получатель = емайл;
	Зап.Тема = Тема;
	Зап.ТекстСообщения = Текст;
	Зап.Записать();
	
	
КонецПроцедуры      

Процедура ОбработатьОчередь() Экспорт
	
	Наб = РегистрыСведений.ОчередьСообщенийОтправка.СоздатьНаборЗаписей();
	наб.Прочитать();      
	Если Наб.Количество() = 0 ТОгда Возврат; КонецЕслИ;
	
	Для а=-Наб.Количество() по -1 Цикл
		Зап = Наб[-а-1];    
		Если Зап.СчетчикОшибок>= 3 Тогда Продолжить; КонецЕсли;
		
		рез = Истина;
		Если ЗначениеЗаполнено(Зап.Получатель) Тогда      
			
			
			ТекстОшибки = "";
			рез = глПочта.Почта(Зап.Получатель,Зап.Тема,Зап.ТекстСообщения,ТекстОшибки);	
			
			Если рез = ложь Тогда
				Зап.ТекстОшибки = ""+ТекстОшибки;
				Зап.СчетчикОшибок = Зап.СчетчикОшибок + 1;
			КонецЕсли;
			
		КонецесЛИ; 
		
		Если Рез=Истина Тогда
			Наб.Удалить(-а-1);   
		КонецЕсли;  
		
	КонецЦикла;           
	
	Наб.Записать();
	                  
КонецПроцедуры
	
