
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	дата = ТекущаяДата();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Номенклатура = ТС.Номенклатура;  
	
	Если Договор.Владелец<>Контрагент Тогда
		Договор = Контрагент.АктивныйДоговор;
	КонецесЛИ;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	ЗАп = Движения.РасчетыЗаПроезд.Добавить(); 
	Зап.ВидДвижения=ВидДвиженияНакопления.Расход;
	Зап.Период = Дата;
	Зап.Контрагент = Контрагент; 
	Зап.Договор = Договор;
	Зап.сумма = Сумма;
	
	Движения.РасчетыЗаПроезд.Записать();	

КонецПроцедуры
