	  
	  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Стк = Новый Структура("фильтрИмя","паромная");
	
	тбл = глОбщий.ДанныеАПИ("NOMENSPIS",Стк);
	
	тблДоговора.Загрузить(тбл);
	

КонецПроцедуры

&НаСервере
Функция тблДоговораВыборНаСервере(Стк)  
	
	сс = Справочники.Номенклатура.ПолучитьСсылку(Стк.ид);
	Если СтрНайти(сс,"не найден")<>0 Тогда
		Обк = Справочники.Номенклатура.СоздатьЭлемент();
		обк.УстановитьСсылкуНового(сс);   
	ИНаче
		обк = сс.ПолучитьОбъект();
	КонецеслИ;  
	
	ЗаполнитьЗначенияСвойств(Обк,Стк);
	Обк.Записать();
	
	Возврат Обк.ссылКа;
	
КонецФункции

&НаКлиенте
Процедура тблДоговораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Стк = Новый Структура("Код,Наименование,ид"); 
	ЗаполнитьЗначенияСвойств(Стк,Элементы.тблДоговора.ТекущиеДанные);
	
	ссДог = тблДоговораВыборНаСервере(Стк);  
	Если ссДог = Неопределено Тогда Возврат; КонецеслИ;
	ОповеститьОбИзменении(ссДог);
	
	этаФОрма.Закрыть();
КонецПроцедуры
