	  
	  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонтрагентВладелец = Параметры.Владелец;
	Стк = Новый Структура("идКА",Параметры.Владелец.УникальныйИдентификатор());
	
	тбл = глОбщий.ДанныеАПИ("DOGPURS",Стк);
	
	тблДоговора.Загрузить(тбл);
	

КонецПроцедуры

&НаСервере
Функция тблДоговораВыборНаСервере(Стк)  
	
	сс = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Стк.ид);
	Если СтрНайти(сс,"не найден")<>0 Тогда
		Обк = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		обк.УстановитьСсылкуНового(сс);   
		обк.Владелец = КонтрагентВладелец;
	ИНаче
		обк = сс.ПолучитьОбъект();
	КонецеслИ;  
	
	Если обк.Владелец <> КонтрагентВладелец Тогда
		Сообщить("ОШибка владельца договора! Владелец "+Обк.владелец);
		Возврат Неопределено;
	КонецеслИ;
	
	ЗаполнитьЗначенияСвойств(Обк,Стк);
	Обк.Записать();
	
	Возврат Обк.ссылКа;
	
КонецФункции

&НаКлиенте
Процедура тблДоговораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Стк = Новый Структура("Код,Наименование,Дата,Номер,СрокДействия,ид"); 
	ЗаполнитьЗначенияСвойств(Стк,Элементы.тблДоговора.ТекущиеДанные);
	
	ссДог = тблДоговораВыборНаСервере(Стк);  
	Если ссДог = Неопределено Тогда Возврат; КонецеслИ;
	ОповеститьОбИзменении(ссДог);
	
	этаФОрма.Закрыть();
КонецПроцедуры
