
&НаСервере
Функция ПолучитьИнПрофиль(Отправитель,Пароль) экспорт

	Если ЗначениеЗаполнено(Отправитель)=Ложь ТОгда
		Отправитель="buhetk@yandex.ru";
		Пароль="mmujqzxpixlhtuqi";
	КонецЕСЛИ;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;          
	Профиль.АдресСервераSMTP = "smtp.yandex.ru";
	
	Профиль.ПользовательSMTP = Отправитель;
	Профиль.ПарольSMTP = Пароль;//"1!qqqqqq";
	
	Профиль.ПортSMTP = 465;
    Профиль.ИспользоватьSSLSMTP = Истина;   
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
    //Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
	Возврат Профиль;
	
КонецФункции

&НаСервере
Процедура ДобавитьПолучателяВПисьмо(пПолучатель, пКудаДобавить)
	// + Алексей, парсинг адресов через ';' и ','
	Если СтрНайти(пПолучатель, ";") <> 0 Или СтрНайти(пПолучатель, ",") <> 0 Тогда
		мМультистрока = СтрЗаменить(СтрЗаменить(пПолучатель, ";", ","), ",", Символы.ПС);
		Для Итр = 1 По СтрЧислоСтрок(мМультистрока) Цикл
			мАдрес = СтрПолучитьСтроку(мМультистрока, Итр);
			Если СокрЛП(мАдрес) <> "" Тогда
				пКудаДобавить.Добавить(мАдрес);
			КонецЕсли;
		КонецЦикла;
	Иначе
		пКудаДобавить.Добавить(пПолучатель);
	КонецЕсли;
КонецПроцедуры

//															Пароль="1!qqqqqq"
&НаСервере
Функция Почта(Получатель,Тема,Текст,ТекстОшибки="",Отправитель="buhetk@yandex.ru",Пароль="mmujqzxpixlhtuqi",ПутьВложения="",Копии="",ТипТекста = Неопределено,ИмяВложения="",ВложенныеФайлы = Неопределено) Экспорт
	
	
	
	ИнПрофиль = ПолучитьИнПрофиль(Отправитель,Пароль);
	
	Если СокрЛП(Получатель)="" Тогда 
		ТекстОшибки = ТекстОшибки+"Не задан адрес получателя!";
		Сообщить(ТекстОшибки);
		Возврат ложь;
	КонецЕСЛИ;
	
	Если ЗначениеЗаполнено(ТипТекста)=Ложь Тогда
		Если ВРЕГ(Лев(Текст,14)) = "<!DOCTYPE HTML" Тогда
			ТипТекста = ТипТекстаПочтовогоСообщения.HTML;	
		КонецеСЛИ;
	КонецЕСли;
	
	
	//Отправим почту
	
	Письмо=Новый ИнтернетПочтовоеСообщение;
	Если ТипЗнч(Получатель) = Тип("Массив") Тогда
		Для каждого Эл из Получатель Цикл
			ДобавитьПолучателяВПисьмо(Эл, Письмо.Получатели);
		КонецЦиклА;
	ИНаче
		ДобавитьПолучателяВПисьмо(Получатель, Письмо.Получатели);
	КонецЕСЛИ;
	
	ЕСли Копии<>"" ТОгда
		ДобавитьПолучателяВПисьмо(Копии, Письмо.Копии);
	КонецЕсЛИ;
	
	Если ТипЗнч(ПутьВложения) = Тип("Соответствие")  Тогда
		Для каждого элВлж из ПутьВложения Цикл
			Письмо.Вложения.Добавить(элВлж.Значение,элВлж.Ключ);
		КонецЦикла;
	ИНАчеЕсли СокрЛП(ПутьВложения)<>"" Тогда
		Письмо.Вложения.Добавить(ПутьВложения,ИмяВложения);
	КонецЕСЛИ;
	
	Если ВложенныеФайлы <> Неопределено Тогда
		Для каждого Эл из ВложенныеФайлы Цикл
			Письмо.Вложения.Добавить(Эл.Вложение.Получить(),Эл.ИмяФайла);	
		КонецЦикла;	
	КонецЕсли;
	
	Письмо.ИмяОтправителя=Отправитель;//+"@yandex.ru";//"@mail.ru";
	Письмо.Отправитель=Отправитель;//+"@yandex.ru";//"@mail.ru";
	Письмо.Кодировка="windows-1251";
	Письмо.Тема=Тема;
	Если ТипТекста=Неопределено ТОгда
		Письмо.Тексты.Добавить(Текст);
	ИНаче
		Письмо.Тексты.Добавить(Текст,ТипТекста);
	КонецЕСЛИ;
	
	ИнПочта=Новый ИнтернетПочта;
	
	Попытка
		ИнПочта.Подключиться(ИнПрофиль);
		ИнПочта.Послать(Письмо);
		//Сообщить("Почта отправлена!");
		ИнПочта.Отключиться();
	Исключение
		ТекстОшибки = ТекстОшибки + ОписаниеОшибки();
		Возврат ЛОжь;
	КонецПопытки;
	
	Письмо = Неопределено;
	
	Возврат Истина;

КонецФункции
