Процедура Алга() Экспорт
	
		
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДоговорыКонтрагентов.ссылка) КАК идДог
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов";
	
	Стк = Новый Структура("Догид",Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("идДог")); 
	стк.Вставить("Дт",МАКС(Дата(2024,12,1),НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-2))));
	
	тбл = глОбщий.ДанныеАПИ("SYNHDOCS",Стк);
	
	
	Для каждого Стр из Тбл Цикл
		ссДок = Документы.ДокументИзБухгалтерии.ПолучитьСсылку(стр.идДок);
		Если стрНайти(ссДОк,"не найден")<>0 Тогда
			обк = Документы.ДокументИзБухгалтерии.СоздатьДокумент();
			обк.УстановитьСсылкуНового(ссДок);
		ИНаче
			обк = ссДок.ПолучитьОбъект();
		КонецесЛИ;   
		
		Если СокрлП(Стр.ВерсияДанных)<>"" Тогда
			Если Стр.ВерсияДанных = обк.инфоВерсияДанных Тогда Продолжить; КонецеслИ;
		КонецеслИ;	
		
		
		обк.Дата = стр.Период;
		обк.ПредставлениеДокумента = Стр.док;
		обк.Сумма = Стр.сумма;
		обк.Договор = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(стр.идДог);
		обк.Контрагент = обк.Договор.Владелец;   
		обк.Содержание = ""+стр.НомерПП+" от "+Лев(СокрЛП(Стр.ДатаПП),10)+" "+Стр.НазначениеПлатежа; 
		обк.инфоВерсияДанных = Стр.ВерсияДанных;
		
		обк.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	
	
КонецПроцедуры