			  
&НаКлиенте
Функция НайтиВладельцаСписка()
	
	поле = Новый ПолеКомпоновкиДанных("Владелец");
	Для каждого эл из Список.Отбор.элементы  Цикл
		Если эл.ЛевоеЗначение = Поле ТОгда
			Возврат Эл.ПравоеЗначение;
		КонецесЛИ;
	КонецЦикла; 
	
	Возврат Неопределено;
	
КонецФункции
			  
			  
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	отказ =Истина;     
	
	Пар = Новый Структура("Владелец",НайтиВладельцаСписка()); 
	Если ЗначениеЗаполнено(Пар.Владелец) = Ложь ТОгда Возврат; КонецеслИ;
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаПодбораДоговора",Пар,ЭтаФорма,ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
