
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		отказ = Истина;
	КонецеслИ;         
	
	сальдо62 = Формат(РегистрыНакопления.РасчетыЗаПроезд.ПолучитьСальдоПоКонтрагенту(Объект.Ссылка),"ЧДЦ=2")+" руб.";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокированПриИзменении(Элемент=Неопределено)
	элементы.ПричинаБлокировки.Видимость = Объект.Заблокирован;
	элементы.ЛогБлокировки.Видимость = Объект.Заблокирован;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаблокированПриИзменении();
КонецПроцедуры
