Функция ПолучитьТариф(КА,Ном) Экспорт
	
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("Контрагент",КА);
	Запрос.УстановитьПараметр("Номенклатура",Ном);
	Запрос.Текст ="ВЫБРАТЬ TOP 1
	              |	ТарифНаПереправуСрезПоследних.Тариф КАК Тариф, Контрагент
	              |ИЗ
	              |	РегистрСведений.ТарифНаПереправу.СрезПоследних КАК ТарифНаПереправуСрезПоследних
	              |ГДЕ
	              |	ТарифНаПереправуСрезПоследних.Контрагент IN (&Контрагент,Значение(Справочник.Контрагенты.ПустаяССылка))
	              |	И ТарифНаПереправуСрезПоследних.Номенклатура = &Номенклатура
				  |
				  |ORDER BY Контрагент DESC
				  |"; 
	
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Возврат Выб.Тариф;
	ИНаче
		Возврат 0;
	КонецеслИ;
	
КонецФункции