Функция НоваяРегистрация(ДанныеЗапроса) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Обк = Документы.ЗаявкиНаРегистрацию.СоздатьДокумент();  
	обк.Дата = ТекущаяДата();
	обк.Состояние = Перечисления.Состояния.НаРассмотрении;
	
	
	тхт = "";
	Для каждого эл из ДанныеЗапроса Цикл
		тхт = тхт + эл.Ключ+": "+эл.значение+символы.ПС;
		
		Если нрег(эл.Ключ) = "inn" Тогда
			обк.ИНН = эл.Значение;	
		ИначеЕсли нрег(эл.Ключ) = "email" Тогда
			обк.емайл = эл.Значение;	
		ИначеЕсли нрег(эл.Ключ) = "name" Тогда
			обк.Наименование = эл.Значение;	
		ИначеЕсли нрег(эл.Ключ) = "phonenumber" Тогда
			обк.Телефон = эл.Значение;	
		ИначеЕсли нрег(эл.Ключ) = "fio" Тогда
			обк.КонтактноеЛицо = эл.Значение;	
		КонецеслИ;
		
	КонецЦиклА;    
	обк.ТекстЗаявки = тхт;
	
	Если Сокрлп(Обк.ИНН)<>"" Тогда
		ссКА = Справочники.Контрагенты.НайтиПоКоду(обк.ИНН); 
		Если ссКА.Пустая() = Ложь ТОгда 
			Возврат "Клиент с таким ИНН уже есть в базе сревиса. Воспользуйтесь меню восстановление пароля для доступа к сервису.";
		КонецЕсли;
	КонецеслИ;
	
	
	обк.записать();  
	
	ОтправитьСообщениеОНовойЗаявке(обк);
	
	Возврат истина;
	
	
КонецФункции   

Процедура ОтправитьСообщениеОНовойЗаявке(сс) Экспорт
	
	Тема = "Новая заявка №"+сс.номер+" "+сс.Наименование+" "+сс.ИНН;
	Текст = "Новая заявка.
	|
	| "+сс+"
	| "+сс.ТекстЗаявки+"
	|
	|-----
	|  Система автоматической рассылки.  
	|";
	
	Получатель = Константы.ЕмайлОповещения.Получить();
	
	РегистрыСведений.ОчередьСообщенийОтправка.ЗаписатьВОчередь(Получатель,тема,текст);
	
	
КонецПроцедуры  



Процедура ОтправитьСообщениеОРегистрации(ссКА,ВосстановлениеПароля=ЛОжь)  Экспорт
	
	Если ВосстановлениеПароля=Ложь Тогда
		Тема = "Регистрация в сервисе переправа ЕТК ";
		ДопТекст = "Сообщаем данные для входа в сервис переправы ЕТК "+Константы.АдресСервиса.Получить()+":";
	Иначе
		Тема = "Восстановление пароля в сервисе переправа ЕТК "; 
		ДопТекст = "Был получен запрос на восстановление пароля. После входа в сервис пароль можно изменить в меню настройки.";
	КонецЕсли;
	
	
	Текст = "Добрый день!
	|
	| "+ДопТекст+"
	|
	| Контрагент: "+ссКА+"
	| Логин: "+ссКА.емайл+"
	| Пароль: "+ссКА.Пароль+"
	|
	|-----
	|  Система автоматической рассылки.  
	|";
	
	Получатель = ссКА.емайл;
	
	РегистрыСведений.ОчередьСообщенийОтправка.ЗаписатьВОчередь(Получатель,тема,текст);
	
	
КонецПроцедуры  

