
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика. 
	Контрагент = Неопределено;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Зарегистрирован Тогда ;
		
		Если ЗначениеЗаполнено(идКонтрагента)=Ложь Тогда  
			отказ = Истина;
			Сообщить("Не выбран контрагент!");
			Возврат;
		КонецеслИ;
		
		сс = Справочники.Контрагенты.ПолучитьСсылку(идКонтрагента);
		Если стрНайти(сокрлП(сс),"не найден")<> 0 Тогда
			ЗагрузитьКонтрагента(сс);
		КонецеслИ;  
		
		Контрагент = сс;
	КонецеслИ
	
КонецПроцедуры   

Функция ЗагрузитьКонтрагента(сс)
	
	
	Обк = Справочники.Контрагенты.СоздатьЭлемент();
	обк.УстановитьСсылкуНового(сс);
	обк.Наименование = имяКонтрагента;
	обк.Код = ИНН;
	обк.записать();
	
	//Стк = Новый Структура("идКА",идКонтрагента);
	//
	//тбл = глОбщий.ДанныеАПИ("KAINN",Стк); 
	//
	//Если тбл.Количество()= 0 тогда
	//	Сообщить("контрагент с ИД "+идКонтрагента+" не найден");
	//	Возврат Неопределено;
	//КонецесЛИ;   
	
	
		
	
КонецФункции
