
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("РегистрСведений.ОчередьСообщенийОтправка.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	КомандаНаСервере();
КонецПроцедуры         

&НаСервере
Процедура КомандаНаСервере()
	РегистрыСведений.ОчередьСообщенийОтправка.ОбработатьОчередь();
	
КонецПроцедуры
