&НаСервереБезКонтекста
Функция КонтрагентТС(ТС)
	Возврат Новый Структура("Владелец,Масса",ТС.Владелец,ТС.масса);
КонецФункции   

&НаСервереБезКонтекста
Функция ПолучитьТариф(КА,ТС)
	
	Возврат РегистрыСведений.ТарифНаПереправу.ПолучитьТариф(КА,ТС.Номенклатура);
	
	
КонецФункции
 
&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	 
	сткРекТС = КонтрагентТС(Объект.ТС);
	объект.Контрагент = сткРекТС.Владелец;
	Если сткРекТС.масса<>0 Тогда
		Объект.МассаТС = сткРекТС.масса;
	КонецЕсли;
	объект.Тариф = ПолучитьТариф(объект.Контрагент,Объект.ТС);    
	
	рез = ПроверкаПередЗаписью(объект.Контрагент,Объект.ТС); 
	Если рез<>"" Тогда
		ПоказатьПредупреждение(,рез);
	КонецесЛИ;
	
	МассаПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура МассаПриИзменении(Элемент=Неопределено) 
	Объект.Масса = Объект.МассаГруза1 + Объект.МассаГруза2 + Объект.МассаГруза3 + Объект.МассаТС + Объект.МассаПрицепа;
	
	Объект.Сумма = Объект.Тариф * Объект.Масса;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	рез = ПроверкаПередЗаписью(объект.Контрагент,Объект.ТС); 
	Если рез<>"" Тогда
		ПоказатьПредупреждение(,рез);  
		Сообщить(рез);
		отказ=истина;
	КонецесЛИ;
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПроверкаПередЗаписью(КА,ТС)
	
	рез = "";
	Если КА.Заблокирован Тогда
		рез = рез +" Контрагент "+КА+" заблокирован!
		| "+Ка.причинаБлокировки+Символы.ПС;
	КонецесЛИ;   
	
	Если ТС.Активен=ложь Тогда
		рез = рез +" ТС "+ТС.Код+" "+ТС+" неактивен";
	КонецесЛИ;                           
	
	Возврат рез; 
	
КонецФункции

&НаКлиенте  
Процедура ДоступностьФормы()
	
	Если Объект.НомерЧекаККМ=0 ТОгда Возврат; КонецеслИ;  
	
	Элементы.ФормаПробитьЧек.видимость = ЛОжь;
		
	
КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПредставлениеТС(ТС)
	
	Возврат ""+ТС.Код;	
	
КонецФункции

&НаКлиенте
Функция ТекстТалона()
	
	Текст = "Талон №"+Объект.Номер+"
	|"+Объект.Дата+" 
	|----------------------
	|Организация : ООО ""ЕТК""
	| 
	|"+Объект.Номенклатура+"
	|
	|    Клиент: "+СокрлП(Объект.Контрагент)+"
	|
	|    Автомобиль: "+СокрЛП(Объект.ТС) + "
	//|
	//|    Масса: "+Объект.Масса+" Тн.
	//|
	//|----------------------
	//|
	|
	|";
	
	Возврат Текст;
	
КонецФункции    

&НаКлиенте
Функция ТекстТалона2()
	
	Текст = "
	|      "+ПредставлениеТС(Объект.ТС) + "
	|
	|    Масса: "+Объект.Масса+" Тн.
	|
	//|----------------------
	//|
	|
	|";
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
Процедура ПробитьЧек(Команда) 
	
	ЭтаФорма.Записать();
	
	COM_port = "13";
	
	FR = Новый COMОбъект("AddIn.Fptr10");            
	FR.setSingleSetting(FR.LIBFPTR_SETTING_MODEL, Строка(FR.LIBFPTR_MODEL_ATOL_AUTO));
	FR.setSingleSetting(FR.LIBFPTR_SETTING_PORT, Строка(FR.LIBFPTR_PORT_COM));
	FR.setSingleSetting(FR.LIBFPTR_SETTING_COM_FILE, "COM"+COM_port); //СОМ порт кассы - например "COM4"
	FR.setSingleSetting(FR.LIBFPTR_SETTING_BAUDRATE, Строка(FR.LIBFPTR_PORT_BR_115200));
	FR.applySingleSettings();   

	Если FR.open()<>0 Тогда // Отправка команды на кассу
		Result=FR.errorCode();
		Сообщить(FR.errorDescription());
		FR.cancelReceipt();  //Отмена чека в случае неудачи
		Возврат;
	КонецЕсли;  
	
	FR.beginNonfiscalDocument();
	
	FR.setParam(FR.LIBFPTR_PARAM_TEXT, ТекстТалона());
	FR.printText();      
	
	FR.setParam(FR.LIBFPTR_PARAM_FONT_DOUBLE_HEIGHT, Истина);
	FR.setParam(FR.LIBFPTR_PARAM_FONT_DOUBLE_WIDTH, Истина);
	FR.setParam(FR.LIBFPTR_PARAM_TEXT, ТекстТалона2());
	FR.printText();      
	
	FR.setParam(FR.LIBFPTR_PARAM_FONT_DOUBLE_HEIGHT, ложь);
	FR.setParam(FR.LIBFPTR_PARAM_FONT_DOUBLE_WIDTH, ложь);
	FR.setParam(FR.LIBFPTR_PARAM_TEXT, СокрЛП(Объект.Ответственный));
	FR.setParam(FR.LIBFPTR_PARAM_TEXT, "----------------------");
	FR.printText();      
	
	FR.endNonfiscalDocument();  
	
	
//FR.setParam(FR.LIBFPTR_PARAM_DATA_TYPE, FR.LIBFPTR_DT_STATUS);
FR.setParam(FR.LIBFPTR_PARAM_FN_DATA_TYPE, FR.LIBFPTR_FNDT_LAST_DOCUMENT);
//FR.queryData();
FR.fnQueryData();
	
	
КонецПроцедуры  



