Функция СткШапка()
	
	ОбщаяСуммаПропись= ЧислоПрописью(Сумма,"Л=ru_RU; ДП=Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж" );	
	
	
	Стк = Новый Структура;
	Стк.вставить("СуммаПрописью",ОбщаяСуммаПропись);
	Стк.вставить("СуммаСНДС",Сумма);
	Стк.Вставить("Сумма",ОКР(Сумма/1.2,2,1));
	Стк.Вставить("СуммаНДС",Стк.СуммаСНДС-Стк.Сумма);
	Стк.Вставить("Дата",Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));  
	Стк.вставить("Номер","ЕТК-"+Формат(ТекущаяДата(),"ДФ=MMddhhmmss"));   
	
	представлениеКА = ""+СокрЛП(Контрагент)+" ИНН "+Контрагент.Код+" email: "+СокрлП(Контрагент.емайл);   
	Стк.вставить("КонтрагентПРедставление",представлениеКА); 
	
	Возврат Стк;
	
КонецФункции

Функция ПЕчать() Экспорт
	
	Макет = ПолучитьМакет("МакетСчет");
	Таб = Новый ТабличныйДокумент;   
	
	СткШапка = СткШапка();
	
	обл = Макет.ПолучитьОбласть("Строка");
	обл.Параметры.Заполнить(СткШапка);
	Таб.Вывести(Обл);
	
	Таб.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	
	Возврат Таб;
	
	
	
	
	
КонецФункции