
Функция СткПолучитьСоединение() Экспорт
	
	СткСоединение = Новый Структура;
	СткСоединение.Вставить("Сервер","localhost");
	СткСоединение.Вставить("Порт",80);
	СткСоединение.Вставить("Логин","Serv");
	СткСоединение.Вставить("Пароль","SERVgfhjkm");
	
	Возврат СткСоединение;
	
КонецФункции

Функция ДанныеАПИ(Метод,Тело=Неопределено) экспорт
	
	
	СткСоединение = СткПолучитьСоединение();
	
	Соединение = Новый HTTPСоединение(
	СткСоединение.Сервер, // сервер (хост)
	СткСоединение.Порт, // порт, по умолчанию для http используется 80, для https 443
	СткСоединение.Логин, // пользователь для доступа к серверу (если он есть)
	СткСоединение.Пароль, // пароль для доступа к серверу (если он есть)
	, // здесь указывается прокси, если он есть
	, // таймаут в секундах, 0 или пусто - не устанавливать
	// защищенное соединение, если используется https
	);   
	
	БазаБух = "buhETK30";//СокрлП(РегистрыСведений.ксНастройкиСистемы.ПолучитьСвВоБазаЗУП());
	
	Запрос = Новый HTTPЗапрос("/"+БазаБух+"/hs/ksAPI/"+метод);
	Запрос.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	
	Если Тело<>Неопределено Тогда
		Стр = XMLСтрока(Новый ХранилищеЗначения(Тело, Новый СжатиеДанных(6)));
		Запрос.УстановитьТелоИзСтроки(стр);
	КонецЕСЛИ;
	
	Результат = Соединение.POST(Запрос);
	
	Если Результат.КодСостояния <> 200 Тогда 
		Сообщить("Ошибка отправки: "+Результат.КодСостояния);
		Сообщить(результат.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕСЛИ;  
	
	Тбл = XMLЗначение(Тип("ХранилищеЗначения"),результат.ПолучитьТелоКакСтроку()).Получить();
	//Если ТипЗнч(ТБл) <> Тип("ТаблицаЗначений") Тогда
	//	Сообщить("Неверый формат полученных данных!");
	//	Возврат Неопределено;
	//КонецеСЛИ;
	
	
	Возврат Тбл;
	
	
КонецФункции

Процедура ОбработкаОчередиОтправки() Экспорт
	РегистрыСведений.ОчередьСообщенийОтправка.ОбработатьОчередь();
КонецПроцедуры

Процедура Синхронизация() Экспорт
	обр = ОБработки.СинхроДокументыБух.Создать();
	обр.Алга();
КонецПроцедуры

 