
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	отказ =Истина;     
	
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбораНоменклатуры",,ЭтаФорма,ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика    
	Если параметры.Свойство("РежимВыбора") ТОгда
		элементы.список.РежимВыбора = Параметры.РежимВыбора;
	КонецеслИ;
	
КонецПроцедуры
